In [1]:
import numpy as np
import pandas as pd

import datetime
from datetime import datetime, date

import matplotlib.pyplot as plt
%matplotlib inline

sp500 = pd.read_csv("./lp/data/sp500.csv",index_col='Symbol',usecols=[0, 2, 3, 7])

In [2]:
np.random.seed(123126)
df = pd.DataFrame({'foo':np.random.random(10000), 'key':range(100, 10100)})
df[:5]

        foo  key
0  0.695669  100
1  0.733297  101
2  0.021261  102
3  0.709838  103
4  0.042302  104

In [18]:
df[df.key==10099]

         foo    key
9999  0.2103  10099

# %timeit 실행코드
실행코드의 수행에 얼마나 시간이 걸리는지 알려줌

In [8]:
%timeit df[df.key==10099]

638 µs ± 1.59 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [22]:
import time
start = time.time()
df[df.key==10099]
end = time.time()
duration = end - start
print(duration)

0.0

In [20]:
df_with_index = df.set_index(['key'])
df_with_index[:5]

          foo
key
100  0.695669
101  0.733297
102  0.021261
103  0.709838
104  0.042302

In [25]:
df_with_index.loc[10099]

foo    0.2103
Name: 10099, dtype: float64

# 인덱스를 잡으면 검색시간이 훨씬 빨라진다

In [24]:
%timeit df_with_index.loc[10099]

113 µs ± 190 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [26]:
temps = pd.DataFrame({ "City": ["Missoula", "Philadelphia"],"Temperature": [70, 80] })
temps

           City  Temperature
0      Missoula           70
1  Philadelphia           80

In [27]:
temps.columns

Index(['City', 'Temperature'], dtype='object')

In [28]:
df_i64 = pd.DataFrame(np.arange(10, 20), index=np.arange(0, 10))
df_i64[:5]

    0
0  10
1  11
2  12
3  13
4  14

In [29]:
df_i64.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [30]:
df_range = pd.DataFrame(np.arange(10, 15))
df_range[:5]

    0
0  10
1  11
2  12
3  13
4  14

In [31]:
df_range.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
df_f64 = pd.DataFrame(np.arange(0, 1000, 5), np.arange(0.0, 100.0, 0.5))
df_f64.iloc[:5]

      0
0.0   0
0.5   5
1.0  10
1.5  15
2.0  20

In [33]:
df_f64.index

Float64Index([ 0.0,  0.5,  1.0,  1.5,  2.0,  2.5,  3.0,  3.5,  4.0,  4.5,
              ...
              95.0, 95.5, 96.0, 96.5, 97.0, 97.5, 98.0, 98.5, 99.0, 99.5],
             dtype='float64', length=200)

In [34]:
df_interval = pd.DataFrame({ "A": [1, 2, 3, 4]},index = pd.IntervalIndex.from_breaks([0, 0.5, 1.0, 1.5, 2.0]))
df_interval

            A
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4

In [35]:
df_interval.index

IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0]],
              closed='right',
              dtype='interval[float64]')

In [41]:
df_categorical = pd.DataFrame({'A': np.arange(6),'B': list('aabbca')})
df_categorical

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  c
5  5  a

In [49]:
cat_dtype = pd.api.types.CategoricalDtype(categories=['c','a','b'], ordered=True)
df_categorical['B'] = df_categorical['B'].astype(cat_dtype)

In [50]:
df_categorical = df_categorical.set_index

In [67]:
rng = pd.date_range('5/1/2017', periods=100, freq='D')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2017-05-01   -0.634180
2017-05-02    0.429109
2017-05-03   -1.629681
2017-05-04    0.448705
2017-05-05    0.008049
                ...
2017-08-04   -0.344354
2017-08-05   -0.812621
2017-08-06   -0.718437
2017-08-07   -0.987620
2017-08-08   -1.866443
Freq: D, Length: 100, dtype: float64

In [68]:
ts.loc['2017-07']

2017-07-01    0.125403
2017-07-02   -0.523911
2017-07-03   -0.342364
2017-07-04   -0.471091
2017-07-05    0.114609
2017-07-06    0.217968
2017-07-07    0.566461
2017-07-08    0.408521
2017-07-09    1.458642
2017-07-10   -1.904155
2017-07-11   -0.544359
2017-07-12   -0.525821
2017-07-13   -0.315683
2017-07-14    0.749504
2017-07-15    0.674445
2017-07-16    0.613792
2017-07-17    1.674121
2017-07-18   -1.640274
2017-07-19   -0.544353
2017-07-20    0.257718
2017-07-21    1.843379
2017-07-22    0.893216
2017-07-23   -0.494046
2017-07-24   -0.618550
2017-07-25    0.602413
2017-07-26    0.172714
2017-07-27   -0.953573
2017-07-28    1.432820
2017-07-29    0.220537
2017-07-30   -0.038837
2017-07-31   -0.088482
Freq: D, dtype: float64

In [54]:
ts.index

DatetimeIndex(['2017-05-01 00:00:00', '2017-05-01 01:00:00',
               '2017-05-01 02:00:00', '2017-05-01 03:00:00',
               '2017-05-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [55]:
periods = pd.PeriodIndex(['2017-1', '2017-2', '2017-3'], freq='M')
periods

PeriodIndex(['2017-01', '2017-02', '2017-03'], dtype='period[M]', freq='M')

In [57]:
period_series = pd.Series(np.random.randn(len(periods)),index=periods)
period_series

2017-01   -0.129960
2017-02   -0.749283
2017-03   -0.747696
Freq: M, dtype: float64

In [58]:
date_times = pd.DatetimeIndex(pd.date_range('5/1/2017',periods=5,freq='H'))
date_times

DatetimeIndex(['2017-05-01 00:00:00', '2017-05-01 01:00:00',
               '2017-05-01 02:00:00', '2017-05-01 03:00:00',
               '2017-05-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [70]:
df_date_times = pd.DataFrame(np.arange(0, len(date_times)),index=date_times)
df_date_times

                     0
2017-05-01 00:00:00  0
2017-05-01 01:00:00  1
2017-05-01 02:00:00  2
2017-05-01 03:00:00  3
2017-05-01 04:00:00  4

In [71]:
df_date_times.index = pd.DatetimeIndex(pd.date_range('6/1/2017',periods=5,freq='H'))
df_date_times

                     0
2017-06-01 00:00:00  0
2017-06-01 01:00:00  1
2017-06-01 02:00:00  2
2017-06-01 03:00:00  3
2017-06-01 04:00:00  4

In [72]:
s = pd.Series(np.arange(0, 5), index=list('abcde'))
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [73]:
s['b']

1

In [74]:
s.loc['b']

1

In [75]:
df = pd.DataFrame([ np.arange(10, 12),np.arange(12, 14)],columns=list('ab'),index=list('vw'))
df

    a   b
v  10  11
w  12  13

In [76]:
df['a']

v    10
w    12
Name: a, dtype: int64

In [77]:
df.loc['w']

a    12
b    13
Name: w, dtype: int64

In [78]:
s['b':'d']

b    1
c    2
d    3
dtype: int32

In [79]:
s.loc['b':'d']

b    1
c    2
d    3
dtype: int32

In [80]:
s.loc[['a', 'c', 'e']]

a    0
c    2
e    4
dtype: int32

In [81]:
sp500[:5]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [82]:
index_moved_to_col = sp500.reset_index()
index_moved_to_col[:5]

  Symbol                  Sector   Price  Book Value
0    MMM             Industrials  141.14      26.668
1    ABT             Health Care   39.60      15.573
2   ABBV             Health Care   53.95       2.954
3    ACN  Information Technology   79.79       8.326
4    ACE              Financials  102.91      86.897

In [83]:
index_moved_to_col.set_index('Sector')[:5]

                       Symbol   Price  Book Value
Sector
Industrials               MMM  141.14      26.668
Health Care               ABT   39.60      15.573
Health Care              ABBV   53.95       2.954
Information Technology    ACN   79.79       8.326
Financials                ACE  102.91      86.897

In [84]:
reindexed = sp500.reindex(index=['MMM', 'ABBV', 'FOO'])
reindexed

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954
FOO             NaN     NaN         NaN

# .reindex() 대신 .loc[]를 사용할 수 있다.(단, 에러발생 가능)

In [86]:
sp500.loc[['MMM', 'ABBV','FOO']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954
FOO             NaN     NaN         NaN

In [85]:
sp500.reindex(columns=['Price','Book Value','NewCol'])[:5]

         Price  Book Value  NewCol
Symbol
MMM     141.14      26.668     NaN
ABT      39.60      15.573     NaN
ABBV     53.95       2.954     NaN
ACN      79.79       8.326     NaN
ACE     102.91      86.897     NaN

In [87]:
sp500[['Price','Book Value']][:5]

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897

In [89]:
reindexed = sp500.reset_index()
multi_fi = reindexed.set_index(['Sector', 'Symbol'])
multi_fi.head()

                                Price  Book Value
Sector                 Symbol
Industrials            MMM     141.14      26.668
Health Care            ABT      39.60      15.573
                       ABBV     53.95       2.954
Information Technology ACN      79.79       8.326
Financials             ACE     102.91      86.897

## 멀티인덱스의 값에 접근하기

In [101]:
multi_fi.loc[('Health Care','ABT')]

Price         39.600
Book Value    15.573
Name: (Health Care, ABT), dtype: float64

In [92]:
multi_fi.index

MultiIndex([(           'Industrials',  'MMM'),
            (           'Health Care',  'ABT'),
            (           'Health Care', 'ABBV'),
            ('Information Technology',  'ACN'),
            (            'Financials',  'ACE'),
            (           'Health Care',  'ACT'),
            ('Information Technology', 'ADBE'),
            (             'Utilities',  'AES'),
            (           'Health Care',  'AET'),
            (            'Financials',  'AFL'),
            ...
            (             'Utilities',  'XEL'),
            ('Information Technology',  'XRX'),
            ('Information Technology', 'XLNX'),
            (            'Financials',   'XL'),
            (           'Industrials',  'XYL'),
            ('Information Technology', 'YHOO'),
            ('Consumer Discretionary',  'YUM'),
            (           'Health Care',  'ZMH'),
            (            'Financials', 'ZION'),
            (           'Health Care',  'ZTS')],
           names=['Sector', 'Symbol'], length=500)

In [91]:
len(multi_fi.index.levels)

2

In [93]:
multi_fi.index.levels[0]

Index(['Consumer Discretionary', 'Consumer Discretionary ', 'Consumer Staples',
       'Consumer Staples ', 'Energy', 'Financials', 'Health Care',
       'Industrials', 'Industries', 'Information Technology', 'Materials',
       'Telecommunications Services', 'Utilities'],
      dtype='object', name='Sector')

In [94]:
multi_fi.index.levels[1]

Index(['A', 'AA', 'AAPL', 'ABBV', 'ABC', 'ABT', 'ACE', 'ACN', 'ACT', 'ADBE',
       ...
       'XLNX', 'XOM', 'XRAY', 'XRX', 'XYL', 'YHOO', 'YUM', 'ZION', 'ZMH',
       'ZTS'],
      dtype='object', name='Symbol', length=500)

In [95]:
multi_fi.index.get_level_values(0)

Index(['Industrials', 'Health Care', 'Health Care', 'Information Technology',
       'Financials', 'Health Care', 'Information Technology', 'Utilities',
       'Health Care', 'Financials',
       ...
       'Utilities', 'Information Technology', 'Information Technology',
       'Financials', 'Industrials', 'Information Technology',
       'Consumer Discretionary', 'Health Care', 'Financials', 'Health Care'],
      dtype='object', name='Sector', length=500)

# 멀티인덱스자료.xs('인덱스')

In [107]:
multi_fi.xs('Industrials')[:5]

         Price  Book Value
Symbol
MMM     141.14      26.668
ALLE     52.46       0.000
APH      95.71      18.315
AVY      48.20      15.616
BA      132.41      19.870

In [97]:
multi_fi.xs('ALLE', level=1)

             Price  Book Value
Sector
Industrials  52.46         0.0

In [105]:
multi_fi.xs('Industrials', level=0)

         Price  Book Value
Symbol
MMM     141.14      26.668
ALLE     52.46       0.000
APH      95.71      18.315
AVY      48.20      15.616
BA      132.41      19.870
...        ...         ...
UNP     196.26      46.957
UPS     102.73       6.790
UTX     115.54      35.252
WM       43.37      12.330
XYL      38.42      12.127

[64 rows x 2 columns]

In [98]:
multi_fi.xs('Industrials', drop_level=False)[:5]

                     Price  Book Value
Sector      Symbol
Industrials MMM     141.14      26.668
            ALLE     52.46       0.000
            APH      95.71      18.315
            AVY      48.20      15.616
            BA      132.41      19.870

In [99]:
multi_fi.xs('Industrials').xs('UPS')

Price         102.73
Book Value      6.79
Name: UPS, dtype: float64

In [106]:
multi_fi.loc[('Industrials','UPS')]

Price         102.73
Book Value      6.79
Name: (Industrials, UPS), dtype: float64

In [100]:
multi_fi.xs(('Industrials', 'UPS'))

Price         102.73
Book Value      6.79
Name: (Industrials, UPS), dtype: float64

# chapter 7

In [108]:
metal_values = ["bronze", "gold", "silver", "bronze"]
metal_categories = ["bronze", "silver", "gold"]
metals = pd.Categorical(metal_values,
                        categories=metal_categories,
                        ordered = True)
metals

[bronze, gold, silver, bronze]
Categories (3, object): [bronze < silver < gold]

In [114]:
metals_reversed_values = pd.Categorical(metals.get_values()[::-1],categories = metals.categories,ordered=True)
metals_reversed_values

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The 'get_values' method is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

[bronze, silver, gold, bronze]
Categories (3, object): [bronze < silver < gold]

In [115]:
metals.describe()

            counts  freqs
categories
bronze           2   0.50
silver           1   0.25
gold             1   0.25

In [116]:
metals.value_counts()

bronze    2
silver    1
gold      1
dtype: int64

In [110]:
metals <= metals_reversed_values

array([ True, False,  True,  True])

In [111]:
metals.codes

array([0, 2, 1, 0], dtype=int8)

# .mode() 최빈값

In [118]:
metals.mode()

[bronze]
Categories (3, object): [bronze < silver < gold]

In [112]:
metals_reversed_values.codes

array([0, 1, 2, 0], dtype=int8)

# 데이터프레임의 값을 구간별로 나눠서 표기하기

In [120]:
np.random.seed(123456)
names = ['Ivana', 'Norris', 'Ruth', 'Lane', 'Skye', 'Sol','Dylan', 'Katina', 'Alissa', "Marc"]
grades = np.random.randint(50, 101, len(names))
scores = pd.DataFrame({'Name': names, 'Grade': grades})
scores

     Name  Grade
0   Ivana     51
1  Norris     92
2    Ruth    100
3    Lane     99
4    Skye     93
5     Sol     97
6   Dylan     93
7  Katina     77
8  Alissa     82
9    Marc     73

In [121]:
score_bins =    [ 0,  59,   62,  66,   69,   72,  76,   79,   82, 86,   89,   92,  99, 100]
letter_grades = ['F', 'D-', 'D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+']

# pd.cut(구간을 나눌 컬럼, 구간, 표기값) 데이터값으로 나눔
# pd.qcut() 데이터의 갯수로 나눔

In [124]:
letter_cats = pd.cut(scores.Grade, score_bins, labels=letter_grades)
scores['Letter'] = letter_cats
scores

     Name  Grade Letter
0   Ivana     51      F
1  Norris     92     A-
2    Ruth    100     A+
3    Lane     99      A
4    Skye     93      A
5     Sol     97      A
6   Dylan     93      A
7  Katina     77     C+
8  Alissa     82     B-
9    Marc     73      C

In [128]:
pd.cut(scores.Grade, 13, labels=letter_grades)

0     F
1    A-
2    A+
3    A+
4     A
5    A+
6     A
7    C+
8     B
9     C
Name: Grade, dtype: category
Categories (13, object): [F < D- < D < D+ ... B+ < A- < A < A+]

In [132]:
df1 = pd.qcut(scores.Grade, 5, labels=list(range(5)))
df1

0    0
1    2
2    4
3    4
4    2
5    3
6    2
7    1
8    1
9    0
Name: Grade, dtype: category
Categories (5, int64): [0 < 1 < 2 < 3 < 4]

In [133]:
df1.value_counts()

2    3
4    2
1    2
0    2
3    1
Name: Grade, dtype: int64